<template>
    
    <div id="partner-info">
        
    </div>
    
</template>

<script>
    export default {
        data() {
            return {
                image: this.getImgUrl('partner'),
                name: "Московский Дом Книги",
                link: "#",
                linkTitle: "mdk-arbat.ru",
                description: "Один из крупнейших в Европе и самый большой в России Московский дом книги на Новом Арбате был " +
                    "открыт в 1967году и с тех пор стал самым популярным книжным магазином нашего города Здесь регулярно " +
                    "проводят различные встречи с интересными и знаменитыми личностями: писателями, актерами и ведущими, " +
                    "мероприятия при поддержке Правительства Москвы, детские фестивали, образовательные программы, " +
                    "благотворительные акции в помощь детям. <br><br>" +
                    "Так же вы можете попасть на различные бесплатные мастер-классы от уроков по макияжу до изучения испанского языка," +
                    " поиграть в настольные игры или литературную мафию. В «Московском Доме Книги» регулярно проходят видео" +
                    " показы и презентации наилучших творений отечественного и зарубежного кинематографа в рамках проекта «Реальное кино». <br><br>" +
                    "А так же на площадке Art-клуба «Переплет» вы можете окунуться в мир творческих людей, артистов Московских театров и кино," +
                    " познакомиться с покупателями и зрителями и обрести новых друзей по интересам.<br><br>" +
                    "Адрес (главный филиал):<br><br>" +
                    "Россия, г. Москва, ул. Новый Арбат, д.8 (м. Арбатская)<br><br>" +
                    "Телефоны:<br><br>" +
                    "+7 (495) 789-35-91 (сеть магазинов)<br>" +
                    "+7 (495) 648-17-68 (интернет-магазин)"
            }
        },
        methods: {
            getImgUrl(imagePath) {
                var images = require.context('../../assets/partners', false, /\.jpg$/);
                return images('./' + imagePath + ".jpg");
            }
        }
    }
</script>

<style scoped>

</style>