<template>
    <div class="courses-container">

        <SectionHeader image="course"
                       title="Cursos"
                       description="Курсы испанского и каталонского в Москве"/>

        <Delimiter/>

        <SubMenu v-bind:items="[
        {
            name: 'Типы курсов',
            active: true
        },
        {
            name: 'Для начинающих',
            active: false
        },
        {
            name: 'Расписание и цены',
            active: false
        },
        {
            name: 'Запись',
            active: false
        }]"/>

        <Delimiter/>

        <div id="courses-grid">

            <Course :image="getImgUrl('spanish')"
                    title="Стандартный курс испанского"
                    description="Классический курс испанского языка в Москве продолжительностью около двух месяцев. 
                    Такой курс легко можно сочетать с работой или учебой. Количество занятий в неделю спланировано так, 
                    чтобы не отнимать у Вас много свободного времени, но и не позволить забыть пройденный материал."
                    duration="60 ак. часов — 2 занятия в неделю по 3,3 академических часа плюс перерыв 15 минут. 
                    Общая продолжительность курса — 9 недель."
                    discount="Скидка 19%"
                    price-info="В стоимость входят учебные материалы."
                    :signup=true
            />

            <Course :image="getImgUrl('spanish')"
                    title="Интенсивный курс испанскогоа"
                    description="Для тех, кто хочет выучить испанский язык в короткие сроки и располагает достаточным для этого временем,
                    мы предлагаем интенсивные курсы разговорного испанского. Занятия проходят в нашем испанском центре 4 раза в неделю, 
                    скорость обучения увеличивается в два раза. При этом вы получаете курс в полном объеме без каких-либо сокращений."
                    duration="60 часов — 4 занятия в неделю по 3,3 академических часа плюс перерыв 15 минут.
                    Общая продолжительность курса — 4,5 недели."
                    discount="Скидка 20%"
                    price-info="В стоимость входят учебные материалы."
                    :signup=true
            />

            <Course :image="getImgUrl('spanish')"
                    title="Курс выходного дня"
                    description="Хотите учить испанский или каталанский язык с нуля, но в течение недели загружены работой? 
                    Уделите ему один из выходных дней в нашей испанской школе. Занятия проводятся в первую или вторую половину дня,
                    с перерывами на чай , во время которых Вы сможете передохнуть, а также насладиться нашей дружной испанской атмосферой."
                    duration="60 часов — 1 занятие в неделю по 5 академических часов плюс два перерыва по 10 минут. 
                    Общая продолжительность курса — 12 недель."
                    price-info="В стоимость входят учебные материалы."
                    :signup=true
            />

            <Course :image="getImgUrl('spanish')"
                    title="Стандартный курс испанского"
                    description="Классический курс испанского языка в Москве продолжительностью около двух месяцев. 
                    Такой курс легко можно сочетать с работой или учебой. Количество занятий в неделю спланировано так, 
                    чтобы не отнимать у Вас много свободного времени, но и не позволить забыть пройденный материал."
                    duration="60 ак. часов — 2 занятия в неделю по 3,3 академических часа плюс перерыв 15 минут. 
                    Общая продолжительность курса — 9 недель."
                    discount="Скидка 19%"
                    price-info="В стоимость входят учебные материалы."                    
                    :signup=true
            />

            <Course :image="getImgUrl('spanish')"
                    title="Интенсивный курс испанскогоа"
                    description="Для тех, кто хочет выучить испанский язык в короткие сроки и располагает достаточным для этого временем,
                    мы предлагаем интенсивные курсы разговорного испанского. Занятия проходят в нашем испанском центре 4 раза в неделю, 
                    скорость обучения увеличивается в два раза. При этом вы получаете курс в полном объеме без каких-либо сокращений."
                    duration="60 часов — 4 занятия в неделю по 3,3 академических часа плюс перерыв 15 минут.
                    Общая продолжительность курса — 4,5 недели."
                    discount="Скидка 20%"
                    price-info="В стоимость входят учебные материалы."
                    :signup=true
            />

            <Course :image="getImgUrl('spanish')"
                    title="Курс выходного дня"
                    description="Хотите учить испанский или каталанский язык с нуля, но в течение недели загружены работой? 
                    Уделите ему один из выходных дней в нашей испанской школе. Занятия проводятся в первую или вторую половину дня,
                    с перерывами на чай , во время которых Вы сможете передохнуть, а также насладиться нашей дружной испанской атмосферой."
                    duration="60 часов — 1 занятие в неделю по 5 академических часов плюс два перерыва по 10 минут. 
                    Общая продолжительность курса — 12 недель."
                    price-info="В стоимость входят учебные материалы."
                    :signup=true
            />

            <Course :image="getImgUrl('spanish')"
                    title="Стандартный курс испанского"
                    description="Классический курс испанского языка в Москве продолжительностью около двух месяцев. 
                    Такой курс легко можно сочетать с работой или учебой. Количество занятий в неделю спланировано так, 
                    чтобы не отнимать у Вас много свободного времени, но и не позволить забыть пройденный материал."
                    duration="60 ак. часов — 2 занятия в неделю по 3,3 академических часа плюс перерыв 15 минут. 
                    Общая продолжительность курса — 9 недель."
                    discount="Скидка 19%"
                    price-info="В стоимость входят учебные материалы."
                    :signup=true
            />

            <Course :image="getImgUrl('spanish')"
                    title="Интенсивный курс испанскогоа"
                    description="Для тех, кто хочет выучить испанский язык в короткие сроки и располагает достаточным для этого временем,
                    мы предлагаем интенсивные курсы разговорного испанского. Занятия проходят в нашем испанском центре 4 раза в неделю, 
                    скорость обучения увеличивается в два раза. При этом вы получаете курс в полном объеме без каких-либо сокращений."
                    duration="60 часов — 4 занятия в неделю по 3,3 академических часа плюс перерыв 15 минут.
                    Общая продолжительность курса — 4,5 недели."
                    discount="Скидка 20%"
                    price-info="В стоимость входят учебные материалы."
                    :signup=true
            />

            <Course :image="getImgUrl('spanish')"
                    title="Курс выходного дня"
                    description="Хотите учить испанский или каталанский язык с нуля, но в течение недели загружены работой? 
                    Уделите ему один из выходных дней в нашей испанской школе. Занятия проводятся в первую или вторую половину дня,
                    с перерывами на чай , во время которых Вы сможете передохнуть, а также насладиться нашей дружной испанской атмосферой."
                    duration="60 часов — 1 занятие в неделю по 5 академических часов плюс два перерыва по 10 минут. 
                    Общая продолжительность курса — 12 недель."
                    price-info="В стоимость входят учебные материалы."
                    :signup=true
            />

            <Course :image="getImgUrl('spanish')"
                    title="Стандартный курс испанского"
                    description="Классический курс испанского языка в Москве продолжительностью около двух месяцев. 
                    Такой курс легко можно сочетать с работой или учебой. Количество занятий в неделю спланировано так, 
                    чтобы не отнимать у Вас много свободного времени, но и не позволить забыть пройденный материал."
                    duration="60 ак. часов — 2 занятия в неделю по 3,3 академических часа плюс перерыв 15 минут. 
                    Общая продолжительность курса — 9 недель."
                    discount="Скидка 19%"
                    price-info="В стоимость входят учебные материалы."
                    :signup=true
            />

            <Course :image="getImgUrl('spanish')"
                    title="Интенсивный курс испанскогоа"
                    description="Для тех, кто хочет выучить испанский язык в короткие сроки и располагает достаточным для этого временем,
                    мы предлагаем интенсивные курсы разговорного испанского. Занятия проходят в нашем испанском центре 4 раза в неделю, 
                    скорость обучения увеличивается в два раза. При этом вы получаете курс в полном объеме без каких-либо сокращений."
                    duration="60 часов — 4 занятия в неделю по 3,3 академических часа плюс перерыв 15 минут.
                    Общая продолжительность курса — 4,5 недели."
                    discount="Скидка 20%"
                    price-info="В стоимость входят учебные материалы."
                    :signup=true
            />

            <Course :image="getImgUrl('spanish')"
                    title="Курс выходного дня"
                    description="Хотите учить испанский или каталанский язык с нуля, но в течение недели загружены работой? 
                    Уделите ему один из выходных дней в нашей испанской школе. Занятия проводятся в первую или вторую половину дня,
                    с перерывами на чай , во время которых Вы сможете передохнуть, а также насладиться нашей дружной испанской атмосферой."
                    duration="60 часов — 1 занятие в неделю по 5 академических часов плюс два перерыва по 10 минут. 
                    Общая продолжительность курса — 12 недель."
                    price-info="В стоимость входят учебные материалы."
                    :signup=true
            />
            
        </div>
        
        <div id="courses-footer">
            
            <span id="footer-title">Курсы испанского в Москве — эффективные методики дают отличный результат</span>
            
            <div id="footer-description">
                <br>
                Стоит ли убеждать в том, что в наше время без знания одного-двух иностранных языков обойтись очень трудно?
                Современный мир каждому человеку предъявляет требование — быть полиглотом. И многие из нас стараются соответствовать
                этому требованию. Современные жители мегаполисов много путешествуют, ведут международный бизнес,
                читают книги на языке оригинала, покупают недвижимость заграницей. Поэтому языковые курсы в Москве не страдают 
                от отсутствия желающих овладеть грамматикой и разговорной речью европейских языков. 
                Испанский язык — один из самых востребованных.
                <br>
                <br>
                Испания за последние годы стала для россиян одной из самых интересных и привлекательных. 
                В эту страну многие едут отдыхать и учиться, строят там дачи, приобретают дома и квартиры, 
                а потому на курсы испанского сегодня записывается большое число желающих выучить язык. 
                Все они — люди разного возраста, социального положения и различных интересов. 
                Вернее, один общий интерес все-таки их объединяет довольно серьезно. Это испанский язык: курсы, общение, культура страны.
                <br>
                <br>
                Всем известно, что в компании единомышленников и под руководством профессионала изучение иностранного языка всегда проходит
                более интересно и эффективно. Многим удается заговорить на испанском языке уже через пару недель обучения.
                Это неудивительно: высококвалифицированные преподаватели, коммуникативные методики, новейшие учебники — 
                все это дает отличный результат. Вы просто начинаете говорить по-испански.
                <br>
                <br>
                Проблема одна — где найти этих единомышленников и хорошего педагога? Какие курсы испанского языка в 
                Москве действительно гарантируют качественное изучение языка в группе неравнодушных людей. 
                Выбирайте те курсы, где работают педагоги c опытом, владеющие современными методами преподавания 
                иностранных языков и изучавшие язык непосредственно в тех странах, где он является государственным. 
                Мы надеемся, что наши курсы испанского языка не только отвечают этим требованиям, 
                но и дают стимул и мотивацию к дальнейшему углублению и погружению в язык, ведь это процесс долгий, 
                который длится годами и, чтобы он действительно был успешным, уже в самом начале нужно применить 
                грамотные стимулирующие методики.
                <br>
                <br>
                Даже если работа идет в группах, преподаватели знают, как найти индивидуальный подход к каждому, 
                кто записался на наши курсы испанского в Москве. Кроме того, занятия организованы так, 
                чтобы участники могли обмениваться знаниями. Процесс обучения — познавательный, разноплановый, неутомительный.
                Готовитесь вы к сдаче экзамена по испанскому, собираетесь на отдых в Испании или язык вам понадобился 
                для продвижения по карьерной лестнице, мы постараемся помочь вам преобрести прочные и уверенные знания испанского языка.
            </div>
        </div>
        
    </div>
    

</template>

<script>

    import SectionHeader from '../components/SectionHeader.vue'
    import Delimiter from '../components/Delimiter.vue'
    import SubMenu from '../components/SubMenu.vue'
    import Course from '../components/Course.vue'

    export default {
        components: {
            SectionHeader,
            Delimiter,
            SubMenu,
            Course
        },
        methods: {
            getImgUrl(imagePath) {
                var images = require.context('../assets/courses', false, /\.jpg$/);
                return images('./' + imagePath + ".jpg");
            }
        }
    }
</script>

<style scoped>

    .courses-container {
        padding: 60px 55px;
        margin-top: 10rem;
        font-size: 1.6rem;
    }
    
    #courses-footer {
        display: flex;
        flex-direction: column;
        margin-top: 50px;
    }

    #courses-grid {
        display: inline-grid;
        grid-template-columns: auto auto auto;
        grid-gap: 50px 35px;
    }
    
    #footer-title {
        font-size: 1.6rem;
        color: #888888;
        font-weight: bold;
        text-align: left;
    }
    
    #footer-description {
        font-size: 1.4rem;
        color: #888888;
        text-align: left;
    }

</style>