<template>
    <div id="feedbacks">
        
        <SectionHeader image="feedback"
                       title="Opiniones"
                       description="Отзывы о курсах испанского"/>
        
        <div id="feedbacks-grid">
            
            <Feedback :image="getImgUrl('feedback1')"
                      text="Я начала изучать испанский язык с нуля. Занимаюсь с группой у преподавателя Хуана.
                  Никогда не думала,что изучать язык может быть так познавательно, весело и захватывающе, т.к.
                  из школьного детства всплывали совершенно другие воспоминания. Всем рекомендую эту школу испанского языка!
                  Приходите заниматься, не бойтесь открывать новые страницы своей жизни!"
                      date="15.02.2016"
                      author="Анжелика Лестиникова"
            />

            <Feedback :image="getImgUrl('feedback2')"
                      text="Я обучалась в течении 3-х лет (правда, с перерывами в обучении), у разных преподавателей. 
                  Мне очень трудно было первые два-три урока, но потом, по мере увелечения словарного запаса - легче. 
                  Очень нравится, что преподаватели - носители языка - это заставляет напрягаться, думать, искать синонимы, не не говорить по-русски.
                  Атмосфера в классе дружелюбная, почти семейная, заниматься интересно."
                      date="17.01.2016"
                      author="Родина Анна"
            />
            
            <Feedback :image="getImgUrl('feedback3')"
                      text="Я изучаю испанский язык в школе уже 4-й год и на каникулах решил подтянуть свои знания. Я занимался с Еленой Алексеевной.
                  Мне очень понравилось, что учительница спокойная, никогда не ругала за ошибки, а просто и понятно объясняла недочёты.
                  Осталось приятное ощущение от общения. При случае обращусь опять за помощью."
                      date="10.02.2016"
                      author="Виталий Лукашев"
            />
            
            <Feedback :image="getImgUrl('feedback4')"
                      text="Учусь в этой школе почти 2 года. Дружеская, семейная атмосфера, небольшие группы. Преподают носители языка. 
                  На занятиях очень интересно и весело. Эффект есть, в Испании свободно разговариваю, почти нет языкового барьера. 
                  Учусь у Ориола. Всем рекомендую!"
                      date="26.04.2015"
                      author="Люба Зимина"
            />

            <Feedback :image="getImgUrl('feedback1')"
                      text="Я начала изучать испанский язык с нуля. Занимаюсь с группой у преподавателя Хуана.
                  Никогда не думала,что изучать язык может быть так познавательно, весело и захватывающе, т.к.
                  из школьного детства всплывали совершенно другие воспоминания. Всем рекомендую эту школу испанского языка!
                  Приходите заниматься, не бойтесь открывать новые страницы своей жизни!"
                      date="15.02.2016"
                      author="Анжелика Лестиникова"
            />

            <Feedback :image="getImgUrl('feedback2')"
                      text="Я обучалась в течении 3-х лет (правда, с перерывами в обучении), у разных преподавателей. 
                  Мне очень трудно было первые два-три урока, но потом, по мере увелечения словарного запаса - легче. 
                  Очень нравится, что преподаватели - носители языка - это заставляет напрягаться, думать, искать синонимы, не не говорить по-русски.
                  Атмосфера в классе дружелюбная, почти семейная, заниматься интересно."
                      date="17.01.2016"
                      author="Родина Анна"
            />

            <Feedback :image="getImgUrl('feedback3')"
                      text="Я изучаю испанский язык в школе уже 4-й год и на каникулах решил подтянуть свои знания. Я занимался с Еленой Алексеевной.
                  Мне очень понравилось, что учительница спокойная, никогда не ругала за ошибки, а просто и понятно объясняла недочёты.
                  Осталось приятное ощущение от общения. При случае обращусь опять за помощью."
                      date="10.02.2016"
                      author="Виталий Лукашев"
            />

            <Feedback :image="getImgUrl('feedback4')"
                      text="Учусь в этой школе почти 2 года. Дружеская, семейная атмосфера, небольшие группы. Преподают носители языка. 
                  На занятиях очень интересно и весело. Эффект есть, в Испании свободно разговариваю, почти нет языкового барьера. 
                  Учусь у Ориола. Всем рекомендую!"
                      date="26.04.2015"
                      author="Люба Зимина"
            />
            
        </div>
        
        <div id="feedbacks-footer">
            
            <span id="footer-title">Откуда берутся отзывы?</span>
            
            <div id="footer-grid">
                
                <img alt="facebook" src="../assets/feedbacks/facebook.png">
                <span>Отзывы с таким значком мы взяли из социальных сетей и интернета. Их можно найти в facebook и vk,
                    на сайтах и форумах.</span>

                <img alt="vcard" src="../assets/feedbacks/vcard.png">
                <span>Это отзывы из анкет, которые наши студенты заполняют в конце курса.
                    Анкеты анонимные, но в большинстве случаев респонденты вписывают свое имя. 
                    Если здесь есть ваш отзыв, и вы не хотите, чтоб он стоял на сайте, сообщите нам.
                    <br>
                    <br>
                    Вы можете оставить свой отзыв через facebook, vk или отправить нам письмо.
                </span>
                
            </div>
            
        </div>
        
    </div>
</template>

<script>
    
    import SectionHeader from '../components/SectionHeader.vue'
    import Feedback from '../components/Feedback.vue'
    
    export default {
        components: {
            SectionHeader,
            Feedback
        },
        methods : {
            getImgUrl(imagePath) {
                var images = require.context('../assets/feedbacks', false, /\.jpg$/);
                return images('./' + imagePath + ".jpg");
            }
        }
    }
</script>

<style scoped>

    #feedbacks-grid {
        display: inline-grid;
        grid-template-columns: auto auto auto auto;
        grid-gap: 50px 35px;
        margin-top: 20px;
        margin-bottom: 20px;
    }
    
    #feedbacks {
        padding: 60px 55px;
    }

    #feedbacks-footer {
        display: flex;
        flex-direction: column;
        margin-top: 20px;
    }
    
    #footer-title {
        font-size: 1.4rem;
        font-weight: bold;
        text-align: left;
    }
    
    #footer-grid {
        display: inline-grid;
        grid-template-columns: auto auto;
        grid-gap: 20px 20px;
        margin: 20px 0;
    }
    
    #footer-grid > span {
        text-align: left;
    }
    
</style>