<template>
    <div id="policy">
        <span id="title">Политика конфиденциальности</span>
        <div id="body">
            Настоящая Политика конфиденциальности персональной информации (далее — Политика) действует в отношении всей
            информации,
            которую ИП Неудачина Н.А может получить о пользователе во время использования им любого из сайтов, сервисов,
            служб,
            программ и продуктов ИП Неудачина Н.А. (далее — Сервисы, Сервисы ИП Неудачина Н.А.). Согласие пользователя
            на
            предоставление персональной информации, данное им в соответствии с настоящей Политикой в рамках отношений с
            одним из лиц,
            работающих в организации ИП Неудачина Н.А., распространяется на все лица, входящие в вышеназванную
            организацию.
            <br>
            <br>
            Использование Сервисов ИП Неудачина Н.А. означает безоговорочное согласие пользователя с настоящей Политикой
            и
            указанными в ней условиями обработки его персональной информации; в случае несогласия с этими условиями
            пользователь
            должен воздержаться от использования Сервисов.
            <br>
            <br>
            <ol>
                <li>
                    Персональная информация пользователей, которую получает и обрабатывает ИП Неудачина Н.А.
                    <ol>
                        <li>
                            В рамках настоящей Политики под «персональной информацией пользователя» понимаются:
                            <ol>
                                <li>
                                    Персональная информация, которую пользователь предоставляет о себе самостоятельно
                                    при регистрации (создании учётной записи) или в процессе использования Сервисов,
                                    включая персональные данные пользователя. Обязательная для предоставления Сервисов
                                    (оказания услуг) информация помечена специальным образом. Иная информация
                                    предоставляется
                                    пользователем на его усмотрение.
                                </li>
                                <li>
                                    Данные, которые автоматически передаются Сервисам ИП Неудачина Н.А. в процессе их
                                    использования с помощью установленного на устройстве пользователя программного
                                    обеспечения,
                                    в том числе IP-адрес, информация из cookie, информация о браузере пользователя
                                    (или иной программе, с помощью которой осуществляется доступ к Сервисам),
                                    время доступа, адрес запрашиваемой страницы.
                                </li>
                                <li>
                                    Иная информация о пользователе, сбор и/или предоставление которой определено в
                                    Регулирующих
                                    документах отдельных Сервисов ИП Неудачина Н.А.
                                </li>
                            </ol>
                        </li>
                        <li>
                            Настоящая Политика применима только к Сервисам ИП Неудачина Н.А.
                            Вышеназванный ИП не контролирует и не несет ответственность за сайты третьих лиц,
                            на которые пользователь может перейти по ссылкам, доступным на сайтах ИП Неудачина Н.А,
                            в том числе в результатах поиска. На таких сайтах у пользователя может собираться или
                            запрашиваться иная персональная информация, а также могут совершаться иные действия.
                        </li>
                        <li>
                            ИП Неудачина Н.А. в общем случае не проверяет достоверность персональной информации,
                            предоставляемой пользователями, и не осуществляет контроль за их дееспособностью.
                            Однако ИП Неудачина Н.А. исходит из того, что пользователь предоставляет достоверную и
                            достаточную персональную информацию по вопросам, предлагаемым в форме регистрации,
                            и поддерживает эту информацию в актуальном состоянии.
                        </li>
                    </ol>
                </li>
                <li>
                    Цели сбора и обработки персональной информации пользователей
                    <ol>
                        <li>
                            ИП Неудачина Н.А. собирает и хранит только те персональные данные,
                            которые необходимы для предоставления Сервисов и оказания услуг (исполнения соглашений и
                            договоров с пользователем).
                        </li>
                        <li>
                            Персональную информацию пользователя ИП Неудачина Н.А. может использовать в следующих целях:
                            <ol>
                                <li>Идентификация стороны в рамках соглашений и договоров с ИП</li>
                                <li>Предоставление пользователю персонализированных Сервисов</li>
                                <li>Связь с пользователем, в том числе направление уведомлений, запросов и информации,
                                    касающихся использования Сервисов, оказания услуг, а также обработка запросов и
                                    заявок от пользователя
                                </li>
                                <li>Улучшение качества Сервисов, удобства их использования, разработка новых Сервисов и
                                    услуг
                                </li>
                                <li>Таргетирование рекламных материалов</li>
                                <li>Проведение статистических и иных исследований на основе обезличенных данных</li>
                            </ol>
                        </li>
                    </ol>
                </li>
                <li>
                    Условия обработки персональной информации пользователя и её передачи третьим лицам
                    <ol>
                        <li>
                            ИП Неудачина Н.А. хранит персональную информацию пользователей в соответствии
                            с внутренними регламентами конкретных сервисов
                        </li>
                        <li>
                            В отношении персональной информации пользователя сохраняется ее конфиденциальность,
                            кроме случаев добровольного предоставления пользователем информации о себе для общего
                            доступа
                            неограниченному кругу лиц. При использовании отдельных Сервисов (например, Мой Круг, Я.ру),
                            пользователь соглашается с тем, что определённая часть его персональной информации
                            становится общедоступной
                        </li>
                        <li>
                            ИП Неудачина Н.А. вправе передать персональную информацию пользователя третьим лицам в
                            следующих случаях
                            <ol>
                                <li>Пользователь выразил свое согласие на такие действия</li>
                                <li>
                                    Передача необходима в рамках использования пользователем определенного Сервиса
                                    либо для оказания услуги пользователю
                                </li>
                                <li>
                                    Передача предусмотрена российским или иным применимым законодательством в рамках
                                    установленной законодательством процедуры
                                </li>
                                <li>
                                    Такая передача происходит в рамках продажи или иной передачи бизнеса (полностью или
                                    в части),
                                    при этом к приобретателю переходят все обязательства по соблюдению условий настоящей
                                    Политики
                                    применительно к полученной им персональной информации
                                </li>
                                <li>
                                    В целях обеспечения возможности защиты прав и законных интересов ИП Неудачина Н.А.
                                    или третьих лиц в случаях, когда пользователь нарушает Пользовательское соглашение
                                    сервисов ИП Неудачина Н.А.
                                </li>
                            </ol>
                        </li>
                        <li>
                            При обработке персональных данных пользователей ИП Неудачина Н.А.
                            руководствуется Федеральным законом РФ «О персональных данных»
                        </li>
                    </ol>
                </li>
                <li>
                    Изменение пользователем персональной информации
                    <ol>
                        <li>
                            Пользователь может в любой момент изменить (обновить, дополнить) предоставленную им
                            персональную информацию или её часть, а также параметры её конфиденциальности,
                            воспользовавшись функцией редактирования
                        </li>
                        <li>Пользователь также может удалить предоставленную им в рамках определенной учетной записи
                            персональную информацию
                        </li>
                    </ol>
                </li>
                <li>
                    Меры, применяемые для защиты персональной информации пользователей ИП Неудачина Н.А.
                    принимает необходимые и достаточные организационные и технические меры для защиты
                    персональной информации пользователя от неправомерного или случайного доступа,
                    уничтожения, изменения, блокирования, копирования, распространения,
                    а также от иных неправомерных действий с ней третьих лиц
                </li>
                <li>
                    Изменение Политики конфиденциальности. Применимое законодательство
                    <ol>
                        <li>
                            ИП Неудачина Н.А. имеет право вносить изменения в настоящую Политику конфиденциальности.
                            При внесении изменений в актуальной редакции указывается дата последнего обновления.
                            Новая редакция Политики вступает в силу с момента ее размещения, если иное не предусмотрено
                            новой редакцией Политики
                        </li>
                        <li>
                            К настоящей Политике и отношениям между пользователем и ИП Неудачина Н.А. ,
                            возникающим в связи с применением Политики конфиденциальности, подлежит применению право
                            Российской Федерации
                        </li>
                    </ol>
                </li>
            </ol>
        </div>
    </div>
</template>

<script>
    export default {}
</script>

<style scoped>

    #policy {
        display: flex;
        flex-direction: column;
        margin: 0 5.5rem 6rem;
        padding: 2rem 4rem;
        background-color: #ffffffb3;
        border-bottom-left-radius: 1rem;
        border-bottom-right-radius: 1rem;
        box-shadow: 0 1px 6px #0000001a;
        text-align: left;
        line-height: 1.3;
        font-size: 1.6rem;
    }

    #title {
        font-size: 1.5rem;
        font-weight: bold;
        margin: 25rem 0 2rem;
    }

    ol {
        counter-reset: item;
        padding: 0;
    }

    li {
        display: block;
        margin: 10px 0;
    }

    li:before {
        content: counters(item, ".") " ";
        counter-increment: item
    }

</style>