<template>
    
    <div id="teachers">

        <SectionHeader image="teachers"
                       title="Profesores"
                       description="Наши преподаватели"/>
        
        <div id="teachers-grid">
            
            <Teacher image="teacher" 
                     name="Йосу" 
                     position="преподаватель"
                     description="Йосу — преподаватель-носитель испанского языка из Барселоны с большим опытом работы.
                     Имеет международный сертификат ELE для преподавания испанского как иностранного 
                     (от International House Barcelona, утвержденным Университетом Барселоны). 
                     Кроме того Йосу является дипломированным экзаменатором экзамена DELE, 
                     это значит что он может как принимать экзамен, так и подготавливать студентов для сдачи DELE.
                     И конечно, имеет сертификат, подтверждающий квалификацию преподавателя от Института Сервантеса 
                     г. Москвы. Работает как со взрослыми, так и с детьми у которых всегда имеет особенный успех. 
                     Уроки проходят в дружественной, неформальной обстановке, что способствует эффективному и 
                     быстрому усвоению материала. Владеет русским языком." />

            <Teacher image="teacher"
                     name="Йосу"
                     position="преподаватель"
                     description="Йосу — преподаватель-носитель испанского языка из Барселоны с большим опытом работы.
                     Имеет международный сертификат ELE для преподавания испанского как иностранного 
                     (от International House Barcelona, утвержденным Университетом Барселоны). 
                     Кроме того Йосу является дипломированным экзаменатором экзамена DELE, 
                     это значит что он может как принимать экзамен, так и подготавливать студентов для сдачи DELE.
                     И конечно, имеет сертификат, подтверждающий квалификацию преподавателя от Института Сервантеса 
                     г. Москвы. Работает как со взрослыми, так и с детьми у которых всегда имеет особенный успех. 
                     Уроки проходят в дружественной, неформальной обстановке, что способствует эффективному и 
                     быстрому усвоению материала. Владеет русским языком." />

            <Teacher image="teacher"
                     name="Йосу"
                     position="преподаватель"
                     description="Йосу — преподаватель-носитель испанского языка из Барселоны с большим опытом работы.
                     Имеет международный сертификат ELE для преподавания испанского как иностранного 
                     (от International House Barcelona, утвержденным Университетом Барселоны). 
                     Кроме того Йосу является дипломированным экзаменатором экзамена DELE, 
                     это значит что он может как принимать экзамен, так и подготавливать студентов для сдачи DELE.
                     И конечно, имеет сертификат, подтверждающий квалификацию преподавателя от Института Сервантеса 
                     г. Москвы. Работает как со взрослыми, так и с детьми у которых всегда имеет особенный успех. 
                     Уроки проходят в дружественной, неформальной обстановке, что способствует эффективному и 
                     быстрому усвоению материала. Владеет русским языком." />

            <Teacher image="teacher"
                     name="Йосу"
                     position="преподаватель"
                     description="Йосу — преподаватель-носитель испанского языка из Барселоны с большим опытом работы.
                     Имеет международный сертификат ELE для преподавания испанского как иностранного 
                     (от International House Barcelona, утвержденным Университетом Барселоны). 
                     Кроме того Йосу является дипломированным экзаменатором экзамена DELE, 
                     это значит что он может как принимать экзамен, так и подготавливать студентов для сдачи DELE.
                     И конечно, имеет сертификат, подтверждающий квалификацию преподавателя от Института Сервантеса 
                     г. Москвы. Работает как со взрослыми, так и с детьми у которых всегда имеет особенный успех. 
                     Уроки проходят в дружественной, неформальной обстановке, что способствует эффективному и 
                     быстрому усвоению материала. Владеет русским языком." />

            <Teacher image="teacher"
                     name="Йосу"
                     position="преподаватель"
                     description="Йосу — преподаватель-носитель испанского языка из Барселоны с большим опытом работы.
                     Имеет международный сертификат ELE для преподавания испанского как иностранного 
                     (от International House Barcelona, утвержденным Университетом Барселоны). 
                     Кроме того Йосу является дипломированным экзаменатором экзамена DELE, 
                     это значит что он может как принимать экзамен, так и подготавливать студентов для сдачи DELE.
                     И конечно, имеет сертификат, подтверждающий квалификацию преподавателя от Института Сервантеса 
                     г. Москвы. Работает как со взрослыми, так и с детьми у которых всегда имеет особенный успех. 
                     Уроки проходят в дружественной, неформальной обстановке, что способствует эффективному и 
                     быстрому усвоению материала. Владеет русским языком." />

            <Teacher image="teacher"
                     name="Йосу"
                     position="преподаватель"
                     description="Йосу — преподаватель-носитель испанского языка из Барселоны с большим опытом работы.
                     Имеет международный сертификат ELE для преподавания испанского как иностранного 
                     (от International House Barcelona, утвержденным Университетом Барселоны). 
                     Кроме того Йосу является дипломированным экзаменатором экзамена DELE, 
                     это значит что он может как принимать экзамен, так и подготавливать студентов для сдачи DELE.
                     И конечно, имеет сертификат, подтверждающий квалификацию преподавателя от Института Сервантеса 
                     г. Москвы. Работает как со взрослыми, так и с детьми у которых всегда имеет особенный успех. 
                     Уроки проходят в дружественной, неформальной обстановке, что способствует эффективному и 
                     быстрому усвоению материала. Владеет русским языком." />

            <Teacher image="teacher"
                     name="Йосу"
                     position="преподаватель"
                     description="Йосу — преподаватель-носитель испанского языка из Барселоны с большим опытом работы.
                     Имеет международный сертификат ELE для преподавания испанского как иностранного 
                     (от International House Barcelona, утвержденным Университетом Барселоны). 
                     Кроме того Йосу является дипломированным экзаменатором экзамена DELE, 
                     это значит что он может как принимать экзамен, так и подготавливать студентов для сдачи DELE.
                     И конечно, имеет сертификат, подтверждающий квалификацию преподавателя от Института Сервантеса 
                     г. Москвы. Работает как со взрослыми, так и с детьми у которых всегда имеет особенный успех. 
                     Уроки проходят в дружественной, неформальной обстановке, что способствует эффективному и 
                     быстрому усвоению материала. Владеет русским языком." />

            <Teacher image="teacher"
                     name="Йосу"
                     position="преподаватель"
                     description="Йосу — преподаватель-носитель испанского языка из Барселоны с большим опытом работы.
                     Имеет международный сертификат ELE для преподавания испанского как иностранного 
                     (от International House Barcelona, утвержденным Университетом Барселоны). 
                     Кроме того Йосу является дипломированным экзаменатором экзамена DELE, 
                     это значит что он может как принимать экзамен, так и подготавливать студентов для сдачи DELE.
                     И конечно, имеет сертификат, подтверждающий квалификацию преподавателя от Института Сервантеса 
                     г. Москвы. Работает как со взрослыми, так и с детьми у которых всегда имеет особенный успех. 
                     Уроки проходят в дружественной, неформальной обстановке, что способствует эффективному и 
                     быстрому усвоению материала. Владеет русским языком." />

        </div>
        
    </div>
    
</template>

<script>
    
    import SectionHeader from "../components/SectionHeader"
    import Teacher from "../components/Teacher"
    
    export default {
        components: {
            SectionHeader,
            Teacher
        }
    }
</script>

<style scoped>

    #teachers {
        padding: 60px 55px;
    }

    #teachers-grid {
        display: inline-grid;
        grid-template-columns: auto auto auto auto;
        grid-gap: 50px 35px;
        margin-top: 40px;
        margin-bottom: 20px;
    }
    
</style>