<template>

    <div id="test">

        <span id="title">Тест по испанскому языку для определения уровня</span>

        <div id="description">
            Пройдите тест на определение уровня испанского языка прямо сейчас! <br><br>

            Вы уже учите или когда-то изучали испанский язык? Хотите определить свой уровень испанского языка? Тогда
            этот тест для вас!<br><br>

            Centro Vamos предлагает вам пройти онлайн тестирование и определить ваш уровень владения испанским!
            Данный вопросник состоит из 4 блоков (Уровень А1, А2, В1, В2). Уровень А1 содержит 16 вопросов,
            все остальные 20 вопросов с вариантами ответов. Пожалуйста, во время прохождения теста старайтесь
            не пользоваться вспомогательными источниками!
            После завершения каждого уровня вы увидите количество верных ответов и ваш результат. <br><br>

            Сложность вопросов идет по возрастанию, от простых к сложным, если вы начинаете испытывать трудности при
            ответе на вопросы, мы советуем вам завершить тестирование и ознакомиться с результатом. Ведь верный подбор
            уровня языка (будь то начальный уровень испанского,средний или продвинутый) это залог успеха при дальнейшем
            изучении!
            Какой именно ваш уровень знаний испанского языка покажет наш тест! Вперед! <br><br>
        </div>

        <a href="#">Перейти к тесту</a>

    </div>

</template>

<script>
    export default {
        name: ""
    }
</script>

<style scoped>

    #test {
        display: flex;
        flex-direction: column;
        margin: 0 55px 60px;
        padding: 20px;
        background-color: #ffffffb3;
        border-bottom-left-radius: 10px;
        border-bottom-right-radius: 10px;
        box-shadow: 0 1px 6px #0000001a;
        text-align: left;
        line-height: 1.5;
        font-size: 1.6rem;
    }

    #title {
        font-size: 3rem;
        font-weight: bold;
        margin: 14rem 0 1rem 0;
    }
    
    a {
        color: #465F99;
        text-decoration: none;
    }
    
    a:hover {
        color: black;
    }

</style>